Tekla Open API Reference for Tekla Structures 2025
ClosedGraphicObject.ClosedGraphicObjectAttributes.Hatch Property
 The hatch attributes of the closed graphic object (the closed graphic object is hatchable).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GraphicObjectHatchAttributes Hatch { get; set; }
Public Property Hatch As GraphicObjectHatchAttributes
	Get
	Set
Property Value
Type: GraphicObjectHatchAttributes
See Also
Reference
ClosedGraphicObject.ClosedGraphicObjectAttributes Class
Tekla.Structures.Drawing Namespace